# 숫자 자료형
print(100)
print(3.14)
# type() 자료형을 반환 *****
print(type(100)) # int - 정수
print(type(3.14)) # float - 실수


# 사칙 연산자.
# 덧셈 , 뺄셈, 곱셈, 나눗셈
# +, -, *, /
# print("", 숫자)
print("5 + 7 =", 5 + 7)
print("5 + 7 = " + str(5+7))
# 여러분이 해봅니다.

print("*"*30)
# 정수 나누기 연산자 : // => 나눈 다음에 소수점 이하 자릿 수 삭제한 후 정수만 남김
print(" 3 / 2 = ", 3 / 2)
print(" 3 // 2 = ", 3 // 2)

# % 나머지 연산자.
# - A를 B로 나누었을 때 나머지를 구함
print(" 5 % 2 = ", 5 % 2)


print("*"*30)

# 제곱 연산자 : ** => 공식에서 많이 사용 한다.
print(" 2 ** 1 = ", 2 ** 1)
print(" 2 ** 2 = ", 2 ** 2)
print(" 2 ** 3 = ", 2 ** 3)
print(" 2 ** 4 = ", 2 ** 4)
print(" 2 ** 5 = ", 2 ** 5)

# * , / 이 + , - 보다 우선 순위가 높다.
print("*"*30)
print(2 + 2 - 2 * 2 / 2 * 2)
print(2 - 2 + 2 / 2 * 2 + 2)

