# 주석입니다.
print("키미노 나마에와 김길동 데스")
print('나의 나이는 20세 입니다')
print("-------------------- 확인 전용선 --------------------------")
print()
print()
print("-------------------- 확인 전용선 --------------------------")
print(" '안녕하세요' 라고 말합니다. ")
print(' "안녕하세요" 라고 말합니다. ')


#이스케이프 문자
# \": 큰따옴표 의미. \' : 작은 따옴표 의미
#\n : 줄바꿈의 의미, \t : tab의 의미
print(" \" 안녕하세요. \"라고 말합니다.")
print("안녕하세요\n코스모100기 입니다.")
print("안녕하세요\t코스모100기 입니다.")

# 문자열 연산
print("*" * 30)
print("골스" * 40)

# 여러줄 주석의 의미
msg = """                                

1. 동해물과 백두산이 마르고 닳도록                     
하느님이 보우하사 우리나라 만세                        
무궁화 삼천리 화려강산                    
대한 사람 대한으로 길이 보전하세                      
"""

print("문자열의 갯수 : ", len(msg))
print("*" * 30)
print(msg)
print("*" * 30)

